duvernea/Embedding_Motors_and_Sensors_Specialization/TempSense.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.3
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2019 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "P3_4_aliases.h"
#include "P3_4.h"
#include "P0_0_aliases.h"
#include "P0_0.h"
#include "LCD.h"
#include "P3_3_aliases.h"
#include "P3_3.h"
#include "P0_1_aliases.h"
#include "P0_1.h"
#include "ADC_DelSig_1.h"
#include "P3_1_aliases.h"
#include "P3_1.h"
#include "P3_0_aliases.h"
#include "P3_0.h"
#include "AMux_1.h"
#include "P3_2_aliases.h"
#include "P3_2.h"
#include "Thermistor_1.h"
#include "P3_7_aliases.h"
#include "P3_7.h"
#include "DAC.h"
#include "LCD_LCDPort_aliases.h"
#include "LCD_LCDPort.h"
#include "ADC_DelSig_1_Ext_CP_Clk.h"
#include "ADC_DelSig_1_IRQ.h"
#include "ADC_DelSig_1_theACLK.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

